# Проверка ударенний
print("-- Где поставить ударение? --")

words = { "Мозаичный" : "и",
          "Сверлит" : "и",
          "Завидно" : "и",
          "Вероисповедание" : "е",
          "Бухгалтеров" : "а",
          "Балуясь" : "у",
          "Вручит" : "и",
          "Дешевизна" : "и",
          "Еретик" : "и",
          "Досуг" : "у",
          "Жалюзи" : "и"
        }
c = 0

for word, key in words.items():
    print('\n    ', word)
    where = input()

    if where == key:
        c += 1

    else:
        if c == 0:
            c = 0

        else: c -= 1

print("\nИтого: {0}/{1}".format(c, len(words)))
